src/DataProcessors/ВводРегламентированныхКадровыхДокументовНаОсновании/ВводРегламентированныхКадровыхДокументовНаОсновании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВводРегламентированныхКадровыхДокументовНаОсновании</name>
  <comment>(Общ)</comment>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.КадровоеПеремещение</types>
      <types>DocumentRef.Увольнение</types>
      <types>DocumentRef.ОтсутствиеНаРаботе</types>
      <types>DocumentRef.ВозвратНаРаботу</types>
      <types>DocumentRef.ПриемНаРаботу</types>
      <types>DocumentRef.ПланированиеОтпуска</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВводНаОсновании</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/РаботникиОрганизаций/РаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизаций</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ПричиныИзмененияСостояния/ПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияСостояния</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПриемНаРаботу</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/ПриемНаРаботу/ПриемНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемНаРаботу</name>
  <comment>(Упр) Прием на работу на предприятие</comment>
  <basedOn>Document.ПриемНаРаботуВОрганизацию</basedOn>
  <basedOn>Catalog.СотрудникиОрганизаций</basedOn>
  <registerRecords>InformationRegister.НамеченныеСобытияПоПерсоналу</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияРаботников</registerRecords>
  <registerRecords>InformationRegister.СостояниеРаботниковНаИспытательномСроке</registerRecords>
  <registerRecords>InformationRegister.Работники</registerRecords>
  <registerRecords>InformationRegister.УчетЗаработкаРаботников</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержанияРаботников</registerRecords>
  <registerRecords>AccumulationRegister.ЗанятыеРабочиеМеста</registerRecords>
  <registerRecords>InformationRegister.ПериодыРаботыРаботников</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Работники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУвольнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапомнитьПоЗавершении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗанимаемыхСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспытательныйСрок</name>
      <type>
        <types>EnumRef.ИспытательныйСрок</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтраженияВУпрУчете</name>
      <type>
        <types>CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</types>
      </type>
    </attributes>
    <attributes>
      <name>УчетНачисленийПоОрганизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Физлицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.УправленческиеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта1</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта2</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта3</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта4</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд1</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд2</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд3</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта5</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта6</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд4</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд5</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйРазряд6</name>
      <type>
        <types>CatalogRef.ТарифныеРазряды</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Взыскания</name>
    <attributes>
      <name>Физлицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.УправленческиеУдержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта1</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта2</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта3</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта4</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта5</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта6</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/ВводРегламентированныхКадровыхДокументовНаОсновании/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполняет табличное поле списком организаций
//
Процедура Автозаполнение() Экспорт
	
	ВводНаОсновании.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ОсновнаяОрганизация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	
	Запрос.УстановитьПараметр("Основание",				Основание);
	Запрос.УстановитьПараметр("ОсновнаяОрганизация",	ОсновнаяОрганизация);
	
	ИмяДокумента = Основание.Метаданные().Имя;
	
	Если ИмяДокумента = "ПриемНаРаботу" Тогда
		Если ОсновнаяОрганизация.Пустая() Тогда
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ИСТИНА КАК Отметка,
			|	Док.Сотрудник.Организация КАК Организация
			|ИЗ
			|	Документ.ПриемНаРаботу.Работники КАК Док
			|ГДЕ
			|	Док.Ссылка = &Основание";
			
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВЫБОР
			|		КОГДА Док.Сотрудник.Организация = &ОсновнаяОрганизация
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Отметка,
			|	Док.Сотрудник.Организация КАК Организация
			|ИЗ
			|	Документ.ПриемНаРаботу.Работники КАК Док
			|ГДЕ
			|	Док.Ссылка = &Основание";
			
		КонецЕсли;
		
	Иначе
		Если ОсновнаяОрганизация.Пустая() Тогда
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ИСТИНА КАК Отметка,
			|	РаботникиОрганизаций.Организация
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|		,
			|		Сотрудник.Физлицо В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				Док.Сотрудник.Физлицо
			|			ИЗ
			|				Документ."+ИмяДокумента+".Работники КАК Док
			|			ГДЕ
			|				Док.Ссылка = &Основание)) КАК РаботникиОрганизаций
			|ГДЕ
			|	РаботникиОрганизаций.ПричинаИзмененияСостояния  <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)";
			
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВЫБОР
			|		КОГДА РаботникиОрганизаций.Организация = &ОсновнаяОрганизация
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Отметка,
			|	РаботникиОрганизаций.Организация
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|		,
			|		Сотрудник.Физлицо В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				Док.Сотрудник.Физлицо
			|			ИЗ
			|				Документ."+ИмяДокумента+".Работники КАК Док
			|			ГДЕ
			|				Док.Ссылка = &Основание)) КАК РаботникиОрганизаций
			|ГДЕ
			|	РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)";
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВводНаОсновании.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // Автозаполнение()

// Функция возвращает имя документа в регл учете в зависимости от 
// документа-основания
//
Функция ПолучитьИмяДокумента() Экспорт
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		Возврат "ПриемНаРаботуВОрганизацию";
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КадровоеПеремещение") Тогда
		Возврат "КадровоеПеремещениеОрганизаций";
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.Увольнение") Тогда
		Возврат "УвольнениеИзОрганизаций";
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтсутствиеНаРаботе") Тогда
		Возврат "ОтсутствиеНаРаботеОрганизаций";
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратНаРаботу") Тогда
		Возврат "ВозвратНаРаботуОрганизаций";
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПланированиеОтпуска") Тогда
		Возврат "ГрафикОтпусковОрганизаций";
		
	Иначе
		Возврат "";
		
	КонецЕсли;
	
КонецФункции // ПолучитьИмяДокумента()

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
